fio-test/results/write_out/256k-io_uring-5.out
job1: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=io_uring, iodepth=1
fio-3.28
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=84022: Sat Jul 13 14:50:21 2024
  write: IOPS=3355, BW=839MiB/s (880MB/s)(84.1GiB/102717msec); 0 zone resets
    slat (usec): min=3, max=284, avg=22.24, stdev= 9.64
    clat (usec): min=80, max=894, avg=270.49, stdev=133.84
     lat (usec): min=84, max=948, avg=293.12, stdev=139.87
    clat percentiles (usec):
     |  1.00th=[  112],  5.00th=[  116], 10.00th=[  117], 20.00th=[  122],
     | 30.00th=[  188], 40.00th=[  215], 50.00th=[  231], 60.00th=[  293],
     | 70.00th=[  322], 80.00th=[  388], 90.00th=[  482], 95.00th=[  570],
     | 99.00th=[  603], 99.50th=[  603], 99.90th=[  619], 99.95th=[  635],
     | 99.99th=[  660]
   bw (  KiB/s): min=533034, max=2157568, per=100.00%, avg=859721.09, stdev=272122.15, samples=205
   iops        : min= 2082, max= 8428, avg=3357.82, stdev=1062.98, samples=205
  lat (usec)   : 100=0.71%, 250=51.51%, 500=39.40%, 750=8.38%, 1000=0.01%
  cpu          : usr=10.78%, sys=3.74%, ctx=344650, majf=0, minf=200
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,344640,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=839MiB/s (880MB/s), 839MiB/s-839MiB/s (880MB/s-880MB/s), io=84.1GiB (90.3GB), run=102717-102717msec

Disk stats (read/write):
    dm-0: ios=0/344359, merge=0/0, ticks=0/79448, in_queue=79448, util=100.00%, aggrios=11/344640, aggrmerge=0/0, aggrticks=1/16154, aggrin_queue=16155, aggrutil=100.00%
  nvme1n2: ios=13/344640, merge=0/0, ticks=1/15965, in_queue=15965, util=100.00%
  nvme4n2: ios=6/344640, merge=0/0, ticks=1/16728, in_queue=16729, util=100.00%
  nvme0n2: ios=18/344640, merge=0/0, ticks=1/16890, in_queue=16891, util=100.00%
  nvme3n2: ios=9/344640, merge=0/0, ticks=1/15583, in_queue=15584, util=100.00%
  nvme2n2: ios=10/344640, merge=0/0, ticks=1/15607, in_queue=15608, util=100.00%