fio-test/results/write_out/32k-io_uring.out
job1: (g=0): rw=write, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=io_uring, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=13448: Mon Jun 10 18:42:05 2024
  write: IOPS=18.6k, BW=581MiB/s (609MB/s)(673GiB/1186761msec); 0 zone resets
    slat (nsec): min=1531, max=663406, avg=10685.48, stdev=5540.16
    clat (usec): min=74, max=2808, avg=409.47, stdev=136.73
     lat (usec): min=76, max=2826, avg=420.73, stdev=137.86
    clat percentiles (usec):
     |  1.00th=[  157],  5.00th=[  223], 10.00th=[  255], 20.00th=[  297],
     | 30.00th=[  322], 40.00th=[  351], 50.00th=[  383], 60.00th=[  424],
     | 70.00th=[  469], 80.00th=[  537], 90.00th=[  611], 95.00th=[  660],
     | 99.00th=[  750], 99.50th=[  791], 99.90th=[  881], 99.95th=[  930],
     | 99.99th=[ 1020]
   bw (  KiB/s): min=510335, max=950317, per=100.00%, avg=597741.19, stdev=5399.56, samples=18885
   iops        : min=15946, max=29697, avg=18677.10, stdev=168.74, samples=18885
  lat (usec)   : 100=0.05%, 250=8.85%, 500=66.50%, 750=23.54%, 1000=1.04%
  lat (msec)   : 2=0.02%, 4=0.01%
  cpu          : usr=4.32%, sys=5.51%, ctx=22057268, majf=0, minf=4526
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,22056960,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=581MiB/s (609MB/s), 581MiB/s-581MiB/s (609MB/s-609MB/s), io=673GiB (723GB), run=1186761-1186761msec

Disk stats (read/write):
    dm-0: ios=48/22056056, merge=0/0, ticks=0/8526884, in_queue=8526884, util=100.00%, aggrios=22/8823808, aggrmerge=0/0, aggrticks=1/358795, aggrin_queue=358796, aggrutil=100.00%
  nvme1n2: ios=26/8823804, merge=0/0, ticks=1/355569, in_queue=355571, util=100.00%
  nvme4n2: ios=12/8823803, merge=0/0, ticks=1/352217, in_queue=352217, util=100.00%
  nvme0n2: ios=36/8823799, merge=0/0, ticks=1/374874, in_queue=374876, util=100.00%
  nvme3n2: ios=18/8823813, merge=0/0, ticks=2/355576, in_queue=355577, util=100.00%
  nvme2n2: ios=20/8823824, merge=0/0, ticks=2/355741, in_queue=355742, util=100.00%