fio-test/results/write_out/64k-libaio-2.out
job1: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
...
fio-3.28
Starting 8 processes

job1: (groupid=0, jobs=8): err= 0: pid=91751: Sat Jun 22 22:44:21 2024
  write: IOPS=28.4k, BW=1774MiB/s (1860MB/s)(673GiB/388508msec); 0 zone resets
    slat (usec): min=2, max=405, avg=12.85, stdev= 8.50
    clat (usec): min=26, max=2751, avg=264.50, stdev=77.18
     lat (usec): min=69, max=2764, avg=277.59, stdev=79.22
    clat percentiles (usec):
     |  1.00th=[  167],  5.00th=[  184], 10.00th=[  192], 20.00th=[  204],
     | 30.00th=[  215], 40.00th=[  227], 50.00th=[  249], 60.00th=[  281],
     | 70.00th=[  297], 80.00th=[  314], 90.00th=[  338], 95.00th=[  383],
     | 99.00th=[  603], 99.50th=[  676], 99.90th=[  725], 99.95th=[  766],
     | 99.99th=[  988]
   bw (  MiB/s): min= 1263, max= 2977, per=100.00%, avg=1782.29, stdev=36.67, samples=6188
   iops        : min=20208, max=47640, avg=28514.31, stdev=586.78, samples=6188
  lat (usec)   : 50=0.01%, 100=0.05%, 250=50.54%, 500=47.96%, 750=1.38%
  lat (usec)   : 1000=0.06%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=3.91%, sys=5.21%, ctx=11028583, majf=0, minf=180
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,11028480,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1774MiB/s (1860MB/s), 1774MiB/s-1774MiB/s (1860MB/s-1860MB/s), io=673GiB (723GB), run=388508-388508msec

Disk stats (read/write):
    dm-0: ios=48/11027265, merge=0/0, ticks=0/2896856, in_queue=2896856, util=100.00%, aggrios=22/4412115, aggrmerge=0/0, aggrticks=1/212002, aggrin_queue=212003, aggrutil=100.00%
  nvme1n2: ios=26/4412104, merge=0/0, ticks=2/212834, in_queue=212835, util=100.00%
  nvme4n2: ios=12/4412114, merge=0/0, ticks=1/213256, in_queue=213256, util=100.00%
  nvme0n2: ios=36/4412116, merge=0/0, ticks=2/207397, in_queue=207399, util=100.00%
  nvme3n2: ios=18/4412121, merge=0/0, ticks=2/213343, in_queue=213345, util=100.00%
  nvme2n2: ios=20/4412121, merge=0/0, ticks=2/213182, in_queue=213184, util=100.00%